#include "application.h"
#include "number.h"
#include <iostream>
#include "matrix.h"

using namespace std;

TApplication::TApplication() {
	
}

int TApplication::menu() {
	setlocale(0, "");
	int ch;

	system("cls");
	cout << "ÌÅÍÞ:\n"
		<< "1 - Ââîä ìàòðèöû\n"
		<< "2 - Ðàñ÷åò îïðåäåëèòåëÿ ìàòðèöû\n"
		<< "3 - Ôîðìèðîâàíèå òðàíñïîíèðîâàííîé ìàòðèöû\n"
		<< "4 - Ðàñ÷åò ðàíãà ìàòðèöû\n"
		<< "5 - Âûâîä ìàòðèöû\n"
		<< "0 - ÂÛÕÎÄ.\n";

	cin >> ch;

	return ch;
}

int TApplication::exec() {
	int ch;
	Matrix Matrix(1, 1);
	Matrix.Fill();

	while (true) {
		ch = menu();
		switch (ch) {
		case 1:
			int choise;
			cout << "\n Êàê õîòèòå çàïîëíèòü ìàòðèöó ? " << "\n";
			cout << "\n    1)Çàïîëíèòü àâòîìàòè÷åñêè " << "\n";\
			cout << "\n    2)Çàïîëíèòü âðó÷íóþ " << "\n";
			cout << "\n    0)Îòìåíà îïåðàöèè " << "\n";
			cin >> choise;
			
			if(choise == 1){
				Matrix.Fill();
				Matrix.Display();
				system("pause");
				break;
			}
			if(choise == 2){
				Matrix.Fill2();
				Matrix.Display();
				system("pause");
				break;
			}
			if(choise == 0){
				cout << "\n Ìàòðèöà íå áûëà èçìåííåíà  " << "\n";
				break;
			}
			else{
				cout << "\n           Îøèáêà " << "\n";
				cout << "\n Ìàòðèöà íå áûëà èçìåííåíà  " << "\n";
				system("pause");
			}
			
			break;
		case 2:
			Matrix.Display();
			cout << "\nÎïðåäåëèòåëü ìàòðèöû: " << Matrix.FindDet() << "\n";
			system("pause");
			break;
		case 3:
			Matrix.Display();
			Matrix.Transport();
			Matrix.Display();
			system("pause");
			break;
		case 4:
			Matrix.Display();
			cout << "\nÐàíã ìàòðèöû: " << Matrix.Rank() << "\n";
			
			system("pause");
			break;
		case 5:
			Matrix.Display();
			system("pause");
			break;
		case 0:
			system("cls");
			cout << "                  CÏÀÑÈÁÎ ÇÀ ÏÐÎÑÌÎÒÐ                  " << "\n";     
			cout << "___________________________________________$$$$$$$$$$$$" << "\n";
			cout << "________________________________________$$$$$$$$$_ __$$$" << "\n";
			cout << "____________________________________$$$$$$$$_____( &)_$$$$" << "\n";
			cout << "________________________________$$$$$$$$$$________ ____$$$$" << "\n";
			cout << "_____________________________$$$$$$$$$$$$$$$____§ §§§_____$" << "\n";
			cout << "___________________________$$$$$$$$$$$$$$$$$$§§ ?§_§§§_____$" << "\n";
			cout << "_________________________$$$$$$$$$$$$$$$$$$$$$§§ §§§_§____" << "\n";
			cout << "______________________$$$$$$$$$$$$$$$$$$_$$$$___§ §§__§_$" << "\n";
			cout << "____________________$$$$$$$$$$$$$_$$$$$$$$_$______ __§" << "\n";
			cout << "___________________$$$$$$$$$$$$$$$$$$$$$$$$_$" << " " << "\n";
			cout << "_________________$$$$$$$$$_$$$$$$$$$$$$$$$$_$" << " " << "\n";
			cout << "_______________$$$$$$$$_§$$$$$$$$$§$$$$$$$$_$" << "\n";
			cout << "_____________$$$$$$$_$$§§§$$$§$$§§$$$$§§$_ $$$" << "\n";
			cout << "____________$$$$$$_§§§$$§§$$§§§$$§§$$§ ?$_$$$" << "\n";
			cout << "___________$$$$$_$§§§$$$$§§§$$$§§§§§$$_ $$$$$" << "\n";
			cout << "__________$$$$$_§§§§§§$$§§§$$§§§§§§ §_$$$$$$" << "\n";
			cout << "_________$$$$_§§0§§§§§§§§§§§§§§§ ?_$$$$$$$" << "\n";
			cout << "________$$$_000§§§00§§§§§000§00§_$$$$$$" << "\n";
			cout << "________$$_0000§§0000§§§00§0§_$$$$$$" << "\n";
			cout << "_______$_0000§§00000§0000_$$$$$$$" << "\n";
			cout << "_____§§00000§000§0000_$$$$$$$$" << "\n";
			cout << "___§00000§0000000_$$$$$$$$$$" << "\n";
			cout << "___000§00000§_§§§§$$$$$$$$$$$$$___......" << "\n";
			cout << "___000§00000§_§§§§$$$$$$$$$$$$$___......" << "\n";
			cout << "_000§0_§§§§§§$$$$$$$_§000_$$$§§§_000000 0000000000000" << "\n";
			cout << "00____§§§§§$$$$$$$_§§00000_$§§§_00000000 000000000000" << "\n";
			cout << "______§§§§$$$$$$$_§§§_’’______§§§__???’" << "\n";
			cout << "                  CÏÀÑÈÁÎ ÇÀ ÏÐÎÑÌÎÒÐ                  " << "\n";
			return 0;
		default:
			break;
		}
	}
}

